# Mac mini home hub layer. Service configs, keys, and runtime state stay manual.
brew "restic"
brew "rclone"
brew "kopia"
brew "syncthing"
brew "caddy"
brew "sing-box"
brew "mihomo"
brew "smartmontools"
brew "nmap"
brew "iperf3"
brew "mtr"
brew "wakeonlan"
brew "wireguard-tools"
brew "mosquitto"

cask "tailscale"
cask "kopiaui"
cask "rustdesk"
cask "keepingyouawake"
