# Core macOS layer: free/open-source-first apps and small native utilities.
brew "git"
brew "git-lfs"
brew "mas"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "btop"

cask "firefox"
cask "google-chrome"
cask "bitwarden"
cask "keka"
cask "localsend"
cask "maccy"
cask "itsycal"
cask "jordanbaird-ice"
cask "stats"
cask "raycast"
cask "font-jetbrains-mono-nerd-font"
