# VS Code extensions installed by windows/configure.ps1 -VSCode via `code --install-extension`.
# configure.ps1 reads this file directly. One extension ID per line; '#' comments allowed.
# Template only: no account, no Settings Sync keys, no private extension feeds.

# Remote / containers / kubernetes (WSL-first workflow)
ms-vscode-remote.vscode-remote-extensionpack
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools

# Python
ms-python.python
ms-python.vscode-pylance
charliermarsh.ruff

# JavaScript / TypeScript / Vue
dbaeumer.vscode-eslint
esbenp.prettier-vscode
Vue.volar

# Java / Spring Boot
vscjava.vscode-java-pack
vmware.vscode-boot-dev-pack
vscjava.vscode-gradle

# Data / markup / config
redhat.vscode-yaml
tamasfe.even-better-toml
yzhang.markdown-all-in-one
davidanson.vscode-markdownlint
editorconfig.editorconfig
mechatroner.rainbow-csv

# Git / GitHub / HTTP
eamodio.gitlens
mhutchie.git-graph
github.vscode-github-actions
humao.rest-client

# Notebook
ms-toolsai.jupyter

# Workspace
alefragnani.project-manager

# Localization
ms-ceintl.vscode-language-pack-zh-hans
