# VS Code extensions installed by windows/configure.ps1 -VSCode via `code --install-extension`.
# configure.ps1 reads this file directly. One extension ID per line; '#' comments allowed.
# Template only: no account, no Settings Sync keys, no private extension feeds.

# Remote / containers / kubernetes (WSL-first workflow)
ms-vscode-remote.remote-wsl
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools

# Python
ms-python.python
ms-python.vscode-pylance
charliermarsh.ruff

# JavaScript / TypeScript / Vue
dbaeumer.vscode-eslint
esbenp.prettier-vscode
Vue.volar

# Java
vscjava.vscode-java-pack

# Data / markup / config
redhat.vscode-yaml
yzhang.markdown-all-in-one
editorconfig.editorconfig

# Git / GitHub / HTTP
eamodio.gitlens
github.vscode-github-actions
humao.rest-client
